import { Component, DoCheck } from '@angular/core';
import { Router } from '@angular/router';
// import { Info} from '../../classes/info';

@Component({
  selector: 'app-test-results',
  templateUrl: './test-results.component.html',
  styleUrls: ['./test-results.component.css']
})
export class TestResultsComponent implements DoCheck {
  lang: number;
  thanks = ['Спасибо!', 'Рахмат!'];
  questionLabel = ['Отражающий вопрос:', 'Ойлуу суроо:'];
  buttons = [
    {
      text: ['Пройти другой тест', 'Дагы бир Тест алып'],
    }
    // text: ['Поделиться через фейсбук', 'Фейсбукта бөлүшүү'],
    // text: ['Поделиться на Twitter', 'Twitter бөлүшүү'],
  ];
  info = [
    {
      title: ['Откровенность', 'Ачыктык'],
      subtitle: [
        'Открытость к опыту описывает измерение личности, которое отличает образных, творческих людей от простых людей, обычных людей.',
        'Тажрыйба ачыктык иш жүзүндө, кадимки адамдардан ойчул, чыгармачыл адамдарды айырмалай табиятын өлчөм айтылат.'
      ],
      body: [
        'Эта черта относится к той степени, в которой люди предпочитают новизну или конвенцию. По тому, как вы ответили на вопросы, вы, кажется, описываете себя как человека, который является простым человеком, и предпочитает, чтобы вещи были простыми и прямыми. Вы могли бы сказать, что это просто облегчает жизнь, если вещи не меняются без необходимости, что искусство не имеет практического применения для вас и что вы считаете, что традиция важнее других.',
        'Бул сапат адамдар жыйынга салыштырмалуу жаңылык артык турган даражада колдонулат. Эгер суроолорго жооп жолунан бурулбаса, кимдир бирөөнүн иш жүзүндө ким катары сүрөттөп жана көрүнгөн нерселер жөнөкөй жана straightforwards болууну артык көрөт. Сиз көркөм силерге эч кандай практикалык колдонууга ээ экенин айтып, жөнү жок өзгөртүү жок болсо, анда анын бир гана жөнөкөй жашоо болот деп, сен салт башкаларга караганда көбүрөөк маанилүү деп эсептейсиз деп ойлошу мүмкүн.'
      ],
      question: [
        'Как вы реагируете на изменение?',
        'Кантип өзгөртүү үчүн, эмне кылышыбыз керек?'
      ]
    }
  ];
  constructor(
    private router: Router
  ) { }

  ngDoCheck() {
    this.lang = Number(localStorage.lang);
  }
}
